#include "castle_defines.h"
#include "castle.h"
#include "castle_utils.h"
#include "castle_keys_vlba.h"
#include "castle_versions.h"

/* lifted from castle_btree.c */
#ifndef DEBUG
#define iter_debug(_f, ...)     ((void)0)
#else
#define iter_debug(_f, _a...)   (castle_printk(LOG_DEBUG, "Iterator  :%.60s:%.4d:  " _f,  \
                                                __func__, __LINE__ , ##_a))
#endif

/**********************************************************************************************/
/* Variable length byte array key btree (vlbatree) definitions */

#define VLBA_TREE_ENTRY_IS_NODE(_slot)          CVT_NODE(*(_slot))
#define VLBA_TREE_ENTRY_IS_LEAF_VAL(_slot)      CVT_LEAF_VAL(*(_slot))
#define VLBA_TREE_ENTRY_IS_LEAF_PTR(_slot)      CVT_LEAF_PTR(*(_slot))
#define VLBA_TREE_ENTRY_IS_ANY_LEAF(_slot)      (CVT_LEAF_VAL(*(_slot)) || CVT_LEAF_PTR(*(_slot)))

#define VLBA_TREE_ENTRY_IS_TOMB_STONE(_slot)    CVT_TOMBSTONE(*(_slot))
#define VLBA_TREE_ENTRY_IS_INLINE(_slot)        CVT_INLINE(*(_slot))
#define VLBA_ENTRY_IS_COUNTER_SET(_slot)        CVT_COUNTER_SET(*(_slot))
#define VLBA_ENTRY_IS_COUNTER_ADD(_slot)        CVT_COUNTER_ADD(*(_slot))
#define VLBA_TREE_ENTRY_IS_LARGE_OBJECT(_slot)  CVT_LARGE_OBJECT(*(_slot))
#define VLBA_TREE_ENTRY_IS_MEDIUM_OBJECT(_slot) CVT_MEDIUM_OBJECT(*(_slot))
#define VLBA_TREE_ENTRY_IS_ONDISK(_slot)        CVT_ON_DISK(*(_slot))

typedef struct vlba_key {
    /* align:   4 */
    /* offset:  0 */ uint32_t length;
    /*          4 */ uint8_t _key[0];
    /*          4 */
} PACKED vlba_key_t;

static const vlba_key_t VLBA_TREE_INVAL_KEY = (vlba_key_t){.length = VLBA_TREE_LENGTH_OF_INVAL_KEY};
static const vlba_key_t VLBA_TREE_MIN_KEY = (vlba_key_t){.length = VLBA_TREE_LENGTH_OF_MIN_KEY};
static const vlba_key_t VLBA_TREE_MAX_KEY = (vlba_key_t){.length = VLBA_TREE_LENGTH_OF_MAX_KEY};

#define VLBA_TREE_KEY_INVAL(_key)          ((_key)->length == VLBA_TREE_INVAL_KEY.length)
#define VLBA_TREE_KEY_MIN(_key)            ((_key)->length == VLBA_TREE_MIN_KEY.length)
#define VLBA_TREE_KEY_MAX(_key)            ((_key)->length == VLBA_TREE_MAX_KEY.length)

struct castle_vlba_tree_entry {
    /* align:   8 */
    /* offset:  0 */ uint8_t                 type;
    /*          1 */ uint8_t                 disabled;
    /*          2 */ uint8_t                 _pad[2];
    /*          4 */ c_ver_t                 version;
    /*          8 */ castle_user_timestamp_t user_timestamp;
    /*         16 */ uint64_t                val_len;
    /*         24 */ c_ext_pos_t             cep;
    /*         40 */ vlba_key_t              key;
    /*         44 *//* Inline values are stored at the end of entry */
} PACKED;

struct castle_vlba_tree_node {
    /* align:   4 */
    /* offset:  0 */ uint32_t    dead_bytes;
    /*          4 */ uint32_t    free_bytes;
    /*          8 */ uint8_t     _unused[56];
    /*         64 */ uint32_t    key_idx[0];
    /*         64 */
} PACKED;

#define VLBA_TREE_NODE_LENGTH(_node)        ({int _ns = (_node)->size;                    \
                                              BUG_ON(_ns == 0 || _ns > 256);              \
                                              (_ns * C_BLK_SIZE); })
#define EOF_VLBA_NODE(_node)                ((uint8_t *) (_node) + VLBA_TREE_NODE_LENGTH(_node))
#define VLBA_KEY_LENGTH(_key)               (VLBA_TREE_KEY_MAX(_key) ? 0 : (_key)->length)
#define VLBA_INLINE_VAL_LENGTH(_entry)                                      \
                (VLBA_TREE_ENTRY_IS_INLINE(_entry) ? (_entry)->val_len : 0)
#define VLBA_ENTRY_LENGTH(_entry)                                           \
                (sizeof(struct castle_vlba_tree_entry) +                    \
                 VLBA_KEY_LENGTH(&(_entry)->key) +                          \
                 VLBA_INLINE_VAL_LENGTH(_entry))
