#include <linux/types.h>
#include <linux/compiler.h>     /* (un)likely() */
#include <linux/string.h>
#include <linux/sort.h>
#include "castle_public.h"
#include "castle_defines.h"
#include "castle.h"
#include "castle_utils.h"
#include "castle_keys_normalized.h"
#include "castle_unit_tests.h"
#include "castle_versions.h"
#ifdef CASTLE_DEBUG
#include "castle_versions.h"
#endif

/*
 * Key manipulation function definitions.
 */

static const struct castle_norm_key SLIM_MIN_KEY   = { .length = NORM_KEY_LENGTH_MIN_KEY };
static const struct castle_norm_key SLIM_MAX_KEY   = { .length = NORM_KEY_LENGTH_MAX_KEY };
static const struct castle_norm_key SLIM_INVAL_KEY = { .length = NORM_KEY_LENGTH_INVAL_KEY };

/**
 * Construct a slim tree key.
 * @see castle_norm_key_pack
 */
inline static void *castle_slim_key_pack(const c_vl_bkey_t *src, void *dst, size_t *dst_len)
{
    return castle_norm_key_pack(src, dst, dst_len);
}

/**
 * Deconstruct a slim tree key into the standard key structure.
 * @see castle_norm_key_unpack
 */
inline static c_vl_bkey_t *castle_slim_key_unpack(const void *src, c_vl_bkey_t *dst, size_t *dst_len)
{
    return castle_norm_key_unpack(src, dst, dst_len);
}

/**
 * Compare two slim tree keys.
 * @see castle_norm_key_compare
 */
inline static int castle_slim_key_compare(const void *a, const void *b)
{
    return castle_norm_key_compare(a, b);
}

/**
 * Return the space (in bytes) that a slim tree key occupies in memory.
 * @see castle_norm_key_size
 */
inline static size_t castle_slim_key_size(const void *key)
{
    return castle_norm_key_size(key);
}

/**
 * Copy a slim tree key.
 * @see castle_norm_key_copy
 */
static void* castle_slim_key_copy(const void *src, void *dst, size_t *dst_len)
{
    const struct castle_norm_key *key = src;

    /* no need to duplicate static keys */
    if (!dst) {
        if (NORM_KEY_MIN(key))
            return (void *) &SLIM_MIN_KEY;
        if (NORM_KEY_MAX(key))
            return (void *) &SLIM_MAX_KEY;
        if (NORM_KEY_INVAL(key))
            return (void *) &SLIM_INVAL_KEY;
    }

    /* ... unless we're explicitly given a buffer to copy them to */
    else if (NORM_KEY_SPECIAL(key))
        return castle_dup_or_copy(src, sizeof key->length, dst, dst_len);

    return castle_norm_key_copy(src, dst, dst_len);
}

/**
 * Create the "next" key of a given slim tree key.
 * @see castle_norm_key_next
 */
static void* castle_slim_key_next(const void *src, void *dst, size_t *dst_len)
{
    const struct castle_norm_key *key = src;

    /* no successor to the min or invalid key */
    BUG_ON(NORM_KEY_MIN(key) || NORM_KEY_INVAL(key));

    /* the successor to the max key is the invalid key */
    if (NORM_KEY_MAX(key))
        return dst ?
            castle_dup_or_copy(&SLIM_INVAL_KEY, sizeof SLIM_INVAL_KEY, dst, dst_len) :
            (void *) &SLIM_INVAL_KEY;

    return castle_norm_key_next(src, dst, dst_len);
}

/**
 * Produce a "next" key suitable for a hypercube-style range query.
 * @see castle_norm_key_hypercube_next
 */
inline static void *castle_slim_key_hc_next(const void *key, const void *low, const void *high)
{
    return castle_norm_key_hypercube_next(key, low, high);
}

/**
 * Deallocate a slim tree key.
 * @see castle_norm_key_free
 */
static void castle_slim_key_dealloc(void *keyv)
{
    struct castle_norm_key *key = keyv;

    /* should not free static keys */
    if (NORM_KEY_MIN(key) || NORM_KEY_MAX(key) || NORM_KEY_INVAL(key))
    {
        /* should not have allocated them either */
        BUG_ON(key != &SLIM_MIN_KEY && key != &SLIM_MAX_KEY && key != &SLIM_INVAL_KEY);
        return;
    }

    castle_norm_key_free(key);
}

/**
 * Return the number of dimensions of a slim tree key.
 * @see castle_norm_key_nr_dims
 */
static int castle_slim_key_nr_dims(const void *keyv)
{
    const struct castle_norm_key *key = keyv;
    return NORM_KEY_SPECIAL(key) ? 0 : castle_norm_key_nr_dims(key);
}

/**
 * Strip a few dimensions off a slim tree key.
 * @see castle_norm_key_strip
 */
static void *castle_slim_key_strip(const void *src, void *dst, size_t *dst_len, int nr_dims)
{
    return castle_norm_key_strip(src, dst, dst_len, nr_dims);
}

/**
 * Hash a slim tree key.
 * @see castle_norm_key_hash
 */
inline static uint32_t castle_slim_key_hash(const void *key,
                                            c_btree_hash_enum_t type,
                                            uint32_t seed)
{
    return castle_norm_key_hash(key, type, seed);
}

/**
 * Print a slim tree key.
 * @see castle_norm_key_print
 */
static void castle_slim_key_print(int level, const void *key)
{
    castle_norm_key_print(level, key);
}

/*
 * Entry type related definitions.
 */

#define TYPE_NODE(type)                  ((type) == CVT_TYPE_NODE)
#define TYPE_TOMBSTONE(type)             ((type) == CVT_TYPE_TOMBSTONE)
#define TYPE_ON_DISK(type)               ((type) == CVT_TYPE_MEDIUM_OBJECT || \
                                          (type) == CVT_TYPE_LARGE_OBJECT)

/*
 * Structure definitions for leaf node entries.
 */

enum {
    LEAF_ENTRY_DISABLED_FLAG  = 1,
    LEAF_ENTRY_TIMESTAMP_FLAG = 2
};

struct slim_leaf_entry {
    /* align:   2 */
    /* offset:  0 */ c_ver_t      version;
    /*          4 */ uint8_t      type;
    /*          5 */ uint8_t      flags;
    /*          6 */ struct castle_norm_key key;
    /*          8 */ /* value information is stored immediately after the key */
} PACKED;

struct slim_inline_val {
    /* align:   2 */
    /* offset:  0 */ uint16_t     length;
    /*          2 */ uint8_t      data[0];
} PACKED;

struct slim_extern_val {
    /* align:   8 */
    /* offset:  0 */ uint64_t     length;
    /*          8 */ c_ext_pos_t  cep;
    /*         24 */
} PACKED;

#define LEAF_ENTRY_MAX_SIZE              (sizeof(struct slim_leaf_entry) -      \
                                          sizeof(struct castle_norm_key) +      \
                                          sizeof(struct slim_inline_val) +      \
                                          sizeof(castle_user_timestamp_t) +     \
                                          SLIM_TREE_MAX_KEY_SIZE +              \
                                          MAX_INLINE_VAL_SIZE +                 \
                                          4) /* for the index entry */
#define LEAF_ENTRY_BASE_SIZE(key)        (sizeof(struct slim_leaf_entry) - sizeof *(key) + \
                                          castle_norm_key_size(key))
#define LEAF_ENTRY_VAL_PTR(entry)        ((void *) ((char *) (entry) + LEAF_ENTRY_BASE_SIZE(&(entry)->key)))
#define LEAF_ENTRY_INLINE_VAL_END(val)   ((char *) (val) + sizeof(struct slim_inline_val) + (val)->length)
#define LEAF_ENTRY_EXTERN_VAL_END(val)   ((char *) (val) + sizeof(struct slim_extern_val))
#define LEAF_ENTRY_IS_DISABLED(entry)    ((entry)->flags & LEAF_ENTRY_DISABLED_FLAG)
#define LEAF_ENTRY_HAS_TIMESTAMP(entry)  ((entry)->flags & LEAF_ENTRY_TIMESTAMP_FLAG)

/**
 * Calculate the size of a leaf entry of the slim tree.
 * @param entry     the entry to calculate the size of
 */
static size_t leaf_entry_size(const struct slim_leaf_entry *entry)
{
    size_t size = LEAF_ENTRY_BASE_SIZE(&entry->key);

    if (!TYPE_ON_DISK(entry->type))
    {
        const struct slim_inline_val *val =
            (const struct slim_inline_val *) ((const char *) entry + size);
        size += sizeof *val + val->length;
    }
    else size += sizeof(struct slim_extern_val);

    if (LEAF_ENTRY_HAS_TIMESTAMP(entry))
        size += sizeof(castle_user_timestamp_t);

    return size;
}

/**
 * Read the value of the timestamp of a leaf entry.
 * @param pos       the byte position where the timestamp starts; on return it points just
 *                  after the timestamp
 */
inline static castle_user_timestamp_t leaf_entry_timestamp_get(const void **pos)
{
    castle_user_timestamp_t timestamp = *((const castle_user_timestamp_t *) *pos);
    *pos = (const char *) *pos + sizeof(castle_user_timestamp_t);
    return timestamp;
}

/**
 * Write the value of the timestamp of a leaf entry.
 * @param pos       the byte position where the timestamp starts; on return it points just
 *                  after the timestamp
 * @param timestamp the timestamp value to write
 */
inline static void leaf_entry_timestamp_put(void **pos, castle_user_timestamp_t timestamp)
{
    *((castle_user_timestamp_t *) *pos) = timestamp;
    *pos = (char *) *pos + sizeof(castle_user_timestamp_t);
}

/*
 * Structure definitions for internal node entries.
 */

enum {
    INTERN_ENTRY_DISABLED_FLAG = 1
};

struct slim_intern_entry {
    /* align:   2 */
    /* offset:  0 */ c_byte_off_t offset;  /* extent ids are stored in the node header */
    /*          8 */ c_ver_t      version;
    /*         12 */ uint8_t      flags;   /* only needed for T0s, for now */
    /*         13 */ uint8_t      _pad;
    /*         14 */ struct castle_norm_key key;
    /*         16 */
} PACKED;

#define INTERN_ENTRY_MAX_SIZE            (sizeof(struct slim_intern_entry) - \
                                          sizeof(struct castle_norm_key) +   \
                                          SLIM_TREE_MAX_KEY_SIZE +           \
                                          4) /* for the index entry */
#define INTERN_ENTRY_BASE_SIZE(key)      (sizeof(struct slim_intern_entry) - sizeof *(key) + \
                                          castle_norm_key_size(key))
#define INTERN_ENTRY_IS_DISABLED(entry)  ((entry)->flags & INTERN_ENTRY_DISABLED_FLAG)

/**
 * Calculate the size of an internal (i.e., non-leaf) entry of the slim tree.
 * @param entry     the entry to calculate the size of
 */
static size_t intern_entry_size(const struct slim_intern_entry *entry)
{
    return INTERN_ENTRY_BASE_SIZE(&entry->key);
}

/*
 * Structure definitions for the node header.
 */

/* must update the offsets and the size of _unused[] below if this is changed */
#define SLIM_MAX_EXTENTS 4

struct slim_header {
    /* align:   4 */
    /* offset:  0 */ uint8_t      revision;
    /*          1 */ uint8_t      _pad;
    /*          2 */ uint16_t     data_offset; /* from the start of the node */
    /*          4 */ uint32_t     dead_bytes;
    /*          8 */ uint32_t     free_bytes;
    /*         12 */ uint32_t     extent_entries[SLIM_MAX_EXTENTS];
    /*         28 */ c_ext_id_t   extent_ids[SLIM_MAX_EXTENTS];
    /*         60 */ uint8_t      _unused[4];
    /*         64 */
} PACKED;

/* half a kB limit on the total node header size; only needed for max_entries() */
/* note that this includes the size of the node-independent castle_btree_node   */
#define SLIM_HEADER_MAX                  512
#define SLIM_HEADER_PTR(node)            ((struct slim_header *) BTREE_NODE_PAYLOAD(node))

/*
 * Extent array manipulation for internal nodes.
 */

/**
 * Initialize the extents array of internal nodes of the slim tree.
 * @param header    pointer to the node's header structure
 */
static void intern_entry_extents_init(struct slim_header *header)
{
    int i;
    for (i = 0; i < SLIM_MAX_EXTENTS; ++i)
    {
        header->extent_entries[i] = 0;
        header->extent_ids[i] = INVAL_EXT_ID;
    }
}

/**
 * Locate the position of the extents array with the extent ID for the given index.
 * @param header    pointer to the node's header structure
