#include <linux/types.h>
#include <linux/compiler.h>     /* (un)likely() */
#include <linux/string.h>
#include <linux/sort.h>
#include "castle_public.h"
#include "castle_defines.h"
#include "castle.h"             /* XXX: needs to go away */
#include "castle_utils.h"
#include "castle_keys_normalized.h"
#ifdef CASTLE_DEBUG
#include "castle_versions.h"
#endif

/*
 * Key manipulation function definitions.
 */

static const struct castle_norm_key SLIM_MIN_KEY   = { .length = NORM_KEY_LENGTH_MIN_KEY };
static const struct castle_norm_key SLIM_MAX_KEY   = { .length = NORM_KEY_LENGTH_MAX_KEY };
static const struct castle_norm_key SLIM_INVAL_KEY = { .length = NORM_KEY_LENGTH_INVAL_KEY };

inline static void *castle_slim_key_pack(const c_vl_bkey_t *src, void *dst, size_t *dst_len)
{
    return castle_norm_key_pack(src, dst, dst_len);
}

inline static c_vl_bkey_t *castle_slim_key_unpack(const void *src, c_vl_bkey_t *dst, size_t *dst_len)
{
    return castle_norm_key_unpack(src, dst, dst_len);
}

inline static int castle_slim_key_compare(const void *a, const void *b)
{
    return castle_norm_key_compare(a, b);
}

inline static size_t castle_slim_key_size(const void *key)
{
    return castle_norm_key_size(key);
}

static void* castle_slim_key_copy(const void *src, void *dst, size_t *dst_len)
{
    const struct castle_norm_key *key = src;

    /* no need to duplicate static keys */
    if (!dst) {
        if (NORM_KEY_MIN(key))
            return (void *) &SLIM_MIN_KEY;
        if (NORM_KEY_MAX(key))
            return (void *) &SLIM_MAX_KEY;
        if (NORM_KEY_INVAL(key))
            return (void *) &SLIM_INVAL_KEY;
    }

    /* ... unless we're explicitly given a buffer to copy them to */
    else if (NORM_KEY_SPECIAL(key))
        return castle_dup_or_copy(src, sizeof key->length, dst, dst_len);

    return castle_norm_key_copy(src, dst, dst_len);
}

static void* castle_slim_key_next(const void *src, void *dst, size_t *dst_len)
{
    const struct castle_norm_key *key = src;

    /* no successor to the min or invalid key */
    BUG_ON(NORM_KEY_MIN(key) || NORM_KEY_INVAL(key));

    /* the successor to the max key is the invalid key */
    if (NORM_KEY_MAX(key))
        return dst ?
            castle_dup_or_copy(&SLIM_INVAL_KEY, sizeof SLIM_INVAL_KEY, dst, dst_len) :
            (void *) &SLIM_INVAL_KEY;

    return castle_norm_key_next(src, dst, dst_len);
}

inline static void *castle_slim_key_hc_next(const void *key, const void *low, const void *high)
{
    return castle_norm_key_hypercube_next(key, low, high);
}

static void castle_slim_key_dealloc(void *keyv)
{
    struct castle_norm_key *key = keyv;

    /* should not free static keys */
    if (NORM_KEY_MIN(key) || NORM_KEY_MAX(key) || NORM_KEY_INVAL(key))
    {
        /* should not have allocated them either */
        BUG_ON(key != &SLIM_MIN_KEY && key != &SLIM_MAX_KEY && key != &SLIM_INVAL_KEY);
        return;
    }

    castle_norm_key_free(key);
}

inline static uint32_t castle_slim_key_hash(const void *key, uint32_t seed)
{
    return castle_norm_key_hash(key, seed);
}

static void castle_slim_key_print(int level, const void *key)
{
    castle_norm_key_print(level, key);
}

/*
 * Entry type related definitions.
 */

/* only needed for T0s */
#define STRIP_DISABLED(type)             ((type) & ~CVT_TYPE_DISABLED_FLAG)

#define TYPE_NODE(type)                  ((type) == CVT_TYPE_NODE)
#define TYPE_TOMBSTONE(type)             ((type) == CVT_TYPE_TOMBSTONE)
#define TYPE_ON_DISK(type)               ((type) == CVT_TYPE_MEDIUM_OBJECT || \
                                          (type) == CVT_TYPE_LARGE_OBJECT)

/* XXX: lifted from castle_btree_vlba_tree.c; should reside somewhere in common */
inline static int cvt_type_to_entry_type(int type)
{
    /* Local counters will be turned into inline counters. */
    if (type == CVT_TYPE_COUNTER_LOCAL_SET)
        return CVT_TYPE_COUNTER_SET;
    if (type == CVT_TYPE_COUNTER_LOCAL_ADD)
        return CVT_TYPE_COUNTER_ADD;

    /* Otherwise, just use the cvt type directly. */
    return type;
}

/*
 * Structure definitions for leaf node entries.
 */

struct slim_leaf_entry {
    /* align:   2 */
    /* offset:  0 */ c_ver_t      version;
    /*          4 */ uint8_t      type;
    /*          5 */ uint8_t      _pad;
    /*          6 */ struct castle_norm_key key;
    /*          8 */ /* value information is stored immediately after the key */
} PACKED;

struct slim_inline_val {
    /* align:   2 */
    /* offset:  0 */ uint16_t     length;
    /*          2 */ uint8_t      data[0];
} PACKED;

struct slim_extern_val {
    /* align:   8 */
    /* offset:  0 */ uint64_t     length;
    /*          8 */ c_ext_pos_t  cep;
    /*         24 */
} PACKED;

#define LEAF_ENTRY_MAX_SIZE              (sizeof(struct slim_leaf_entry) - \
                                          sizeof(struct castle_norm_key) + \
                                          sizeof(struct slim_inline_val) + \
                                          SLIM_TREE_MAX_KEY_SIZE +         \
                                          MAX_INLINE_VAL_SIZE +            \
                                          4) /* for the index entry */
#define LEAF_ENTRY_BASE_SIZE(key)        (sizeof(struct slim_leaf_entry) - sizeof *(key) + \
                                          castle_norm_key_size(key))
#define LEAF_ENTRY_VAL_PTR(entry)        ((char *) (entry) + LEAF_ENTRY_BASE_SIZE(&(entry)->key))
#define LEAF_ENTRY_INLINE_VAL_PTR(entry) ((struct slim_inline_val *) LEAF_ENTRY_VAL_PTR(entry))
#define LEAF_ENTRY_EXTERN_VAL_PTR(entry) ((struct slim_extern_val *) LEAF_ENTRY_VAL_PTR(entry))

inline static size_t leaf_entry_size(const struct slim_leaf_entry *entry)
{
    size_t base_size = LEAF_ENTRY_BASE_SIZE(&entry->key);
    if (!TYPE_ON_DISK(STRIP_DISABLED(entry->type)))
    {
        const struct slim_inline_val *val =
            (const struct slim_inline_val *) ((const char *) entry + base_size);
        return base_size + sizeof *val + val->length;
    }
    else return base_size + sizeof(struct slim_extern_val);
}

/*
 * Structure definitions for internal node entries.
 */

struct slim_intern_entry {
    /* align:   2 */
    /* offset:  0 */ c_byte_off_t offset;  /* extent ids are stored in the node header */
    /*          8 */ c_ver_t      version;
    /*         12 */ uint8_t      type;    /* only needed for T0s */
    /*         13 */ uint8_t      _pad;
    /*         14 */ struct castle_norm_key key;
    /*         16 */
} PACKED;

#define INTERN_ENTRY_MAX_SIZE            (sizeof(struct slim_intern_entry) - \
                                          sizeof(struct castle_norm_key) +   \
                                          SLIM_TREE_MAX_KEY_SIZE +           \
                                          4) /* for the index entry */
#define INTERN_ENTRY_BASE_SIZE(key)      (sizeof(struct slim_intern_entry) - sizeof *(key) + \
                                          castle_norm_key_size(key))

inline static size_t intern_entry_size(const struct slim_intern_entry *entry)
{
    return INTERN_ENTRY_BASE_SIZE(&entry->key);
}

/*
 * Structure definitions for the node header.
 */

/* must update the offsets and the size of _unused[] below if this is changed */
#define SLIM_MAX_EXTENTS 4

struct slim_header {
    /* align:   4 */
    /* offset:  0 */ uint8_t      revision;
    /*          1 */ uint8_t      _pad[3];
    /*          4 */ uint32_t     dead_bytes;
    /*          8 */ uint32_t     free_bytes;
    /*         12 */ uint32_t     extent_entries[SLIM_MAX_EXTENTS];
    /*         28 */ c_ext_id_t   extent_ids[SLIM_MAX_EXTENTS];
    /*         60 */ uint8_t      _unused[4];
    /*         64 */
} PACKED;

#define SLIM_HEADER_PTR(node) ((struct slim_header *) BTREE_NODE_PAYLOAD(node))

/*
 * Extent array manipulation for internal nodes.
 */

static void intern_entry_extents_init(struct slim_header *header)
{
    int i;
    for (i = 0; i < SLIM_MAX_EXTENTS; ++i)
    {
        header->extent_entries[i] = 0;
        header->extent_ids[i] = INVAL_EXT_ID;
    }
}

static int intern_entry_extent_locate(struct slim_header *header, int idx)
{
    int i, sum;
    for (i = 0, sum = header->extent_entries[0]; sum < idx && i < SLIM_MAX_EXTENTS;
         ++i, sum += header->extent_entries[i]);
    BUG_ON(sum < idx);
    return i;
}

static c_ext_id_t intern_entry_extent_get(struct slim_header *header, int idx)
{
    int i = intern_entry_extent_locate(header, idx);
    return header->extent_ids[i];
}

static void intern_entry_extent_add(struct slim_header *header, int idx, c_ext_id_t id)
{
