#ifndef __CASTLE_H__
#define __CASTLE_H__

#include <asm/byteorder.h>
#include <linux/module.h>
#include <linux/version.h>
#include <linux/workqueue.h>
#include <linux/completion.h>
#include <linux/fs.h>
#include <linux/net.h>
#include <linux/socket.h>
#include <net/sock.h>
#include <linux/rcupdate.h>
#if LINUX_VERSION_CODE <= KERNEL_VERSION(2,6,24)
#include <asm/semaphore.h>
#else
#include <linux/semaphore.h>
#endif


#include "castle_public.h"

/* BUG and BUG_ON redefined to cause reliable crash-dumpable crashes. */
#undef BUG
#undef BUG_ON

/* Enable additional sanity checking to debug merge serialisation/deserialisation */
//#define DEBUG_MERGE_SERDES
extern int castle_merges_checkpoint; /* 0 or 1, default=enabled */

static inline ATTRIB_NORET void bug_fn(char *file, unsigned long line)
{
    panic("Castle BUG, from: %s:%ld\n", file, line);
#if 0
    /* Write the line number into R15, but push it onto the stack first. */
    __asm__ __volatile__ ("pushq %%r15\n\t"
                          "movq %0, %%r15;\n\t"
                          "movq $0x0,0xca511e\n\t"
                            : : "i" (line) : "%r15" );
    /* Will never get here. */
    while(1){};
#endif
}
#define BUG()            do { bug_fn(__FILE__, __LINE__); } while(0)
#define BUG_ON(_cond)    do { if(_cond) BUG(); } while(0)

/* Printk implementation used in the entire filesystem. */
#define PRINTKS_PER_SEC_STEADY_STATE    5
#define PRINTKS_IN_BURST                100
#define PRINTK_BUFFER_MBS               10          /**< Size of printk ring buffer (in MB).    */
#define PRINTK_BUFFER_SIZE              PRINTK_BUFFER_MBS*1024*1024 /**< Size of printk buffer. */
/*#define castle_printk(_f, _a...)    do { if(__printk_ratelimit(                     \
                                                HZ/PRINTKS_PER_SEC_STEADY_STATE,    \
                                                PRINTKS_IN_BURST))                  \
                                            printk(_f, ##_a); } while(0)*/
#define FLE strrchr(__FILE__, '/') ? strrchr(__FILE__, '/') + 1 : __FILE__

#if LINUX_VERSION_CODE <= KERNEL_VERSION(2,6,18)
#define CASTLE_INIT_WORK(_work, _func) INIT_WORK((_work), (void (*)(void *)) (_func), (void *) (_work))
#define CASTLE_DECLARE_WORK(_name, _func) DECLARE_WORK((_name), (void (*)(void *)) _func, &(_name))
#define CASTLE_PREPARE_WORK(_work, _func) PREPARE_WORK((_work), (void (*)(void *)) (_func), (void *) (_work))
#else
#define CASTLE_INIT_WORK(_work, _func) INIT_WORK((_work), (_func))
#define CASTLE_DECLARE_WORK(_name, _func) DECLARE_WORK((_name), (_func))
#define CASTLE_PREPARE_WORK(_work, _func) PREPARE_WORK((_work), (_func))
#endif

#define USED                 __attribute__((used))
#define EXIT_SUCCESS         (0)

#define STATIC_BUG_ON_HELPER(expr) \
        (!!sizeof (struct { unsigned int static_assertion_error: (expr) ? -1 : 1; }))
#define STATIC_BUG_ON(expr) \
        extern int (*assert_function__(void)) [STATIC_BUG_ON_HELPER(expr)]

#define NR_ENV_VARS          8
#define MAX_ENV_LEN          128
STATIC_BUG_ON(LAST_ENV_VAR_ID >= NR_ENV_VARS);
extern char *castle_environment[NR_ENV_VARS];
extern int   castle_fs_inited;
extern int   castle_fs_exiting;

typedef uint32_t tree_seq_t;
#define GLOBAL_TREE         ((tree_seq_t)0)
#define INVAL_TREE          ((tree_seq_t)-1)
#define TREE_GLOBAL(_t)     ((_t) == GLOBAL_TREE)
#define TREE_INVAL(_t)      ((_t) == INVAL_TREE)
#define TREE_SEQ_SHIFT      (24)                    /**< Shift for RWCTs (at levels 0,1)        */

#define INVAL_DA            ((da_id_t)-1)
#define DA_INVAL(_da)       ((_da) == INVAL_DA)

typedef uint32_t block_t;
#define INVAL_BLOCK         ((block_t)-1)
#define BLOCK_INVAL(_b)     ((_b) == INVAL_BLOCK)

/* New Free space structures */

/*
 * WARNING: be careful about changing MAX_NR_SLAVES. It's used to define various on-disk
 * datastructures.
 */
#define MAX_NR_SLAVES   64
/*
 * The minimum number of live slaves we can safely run with. For N-rda this is N.
 * This is hard coded for 2-rda at the moment.
 */
#define MIN_LIVE_SLAVES 2

#define C_CHK_SHIFT                    (20)
#define C_CHK_SIZE                     (1ULL << C_CHK_SHIFT)   /**< Bytes per chunk.             */

#define CHUNK_OFFSET(offset)  ((offset) & (C_CHK_SIZE - 1))
#define BLOCK_OFFSET(offset)  ((offset) & (C_BLK_SIZE - 1))
#define SECTOR_OFFSET(offset) ((offset) & ((1 << 9)-1))
#define CHUNK(offset)         ((offset) >> C_CHK_SHIFT)
#define BLOCK(offset)         ((offset) >> C_BLK_SHIFT)
#define BLK_IN_CHK(offset)    (BLOCK(CHUNK_OFFSET(offset)))
#define BLKS_PER_CHK          (C_CHK_SIZE / C_BLK_SIZE)         /**< Blocks(/pages) per chunk.    */
#define MASK_BLK_OFFSET(offset) (((offset) >> C_BLK_SHIFT) << C_BLK_SHIFT)
#define MASK_CHK_OFFSET(offset) (((offset) >> C_CHK_SHIFT) << C_CHK_SHIFT)

#define POWOF2(_n)            (((_n) & ((_n) - 1)) == 0)
/*  Chunk #                     Description
 *  =======                     ===========
 *   0 - 29                     Super Extent
 *   0                          Super block (Only first 8k)
 *   1                          Reserved
 *   2                          Freespace structures
 *   3 - 29                     Reserved
 *
 *           Leave double the space (Super Extent is 2-RDA)
 *
 *   60                         Micro Extent (Maps of meta extent)
 *
 *   61 - 63                    Reserved
 *
 *   64 - 563 (on each disk)    Meta extent (Spans across multiple disks)
 *                              would occupy 1024 logical chunks
 *    0 -  99                   Extent Structures
 *  100 - 1023                  Extent maps
 */

#define SUP_EXT_ID                     (10)
#define MICRO_EXT_ID                   (332)
#define META_EXT_ID                    (333)
#define MSTORE_EXT_ID                  (444) /* Two extents use 444 and 445. */
#define EXT_SEQ_START                  (1000)

/* Size of special(or logical) extents [in chunks] */
#define SUP_EXT_SIZE                   (30)  /* 2-RDA. Occupies double the space */
#define MICRO_EXT_START                (60)
#define MICRO_EXT_SIZE                 (1)   /* Don't change this */
#define META_SPACE_SIZE                (100)
#define MSTORE_SPACE_SIZE              (50)
#define FREE_SPACE_START               (100)
#define FREESPACE_OFFSET               (2 * C_CHK_SIZE)
#define FREESPACE_SIZE                 (20 * C_CHK_SIZE)

#define sup_ext_to_slave_id(_id)       ((_id) - SUP_EXT_ID)
#define slave_id_to_sup_ext(_id)       ((_id) + SUP_EXT_ID)

/* Logical extent structures are stored seperatly from normal extents. They are
 * stored in extent superblock itself. */
#define LOGICAL_EXTENT(_ext_id)        ((_ext_id) < EXT_SEQ_START && !EXT_ID_INVAL(_ext_id))
#define SUPER_EXTENT(_ext_id)          (((_ext_id) >= SUP_EXT_ID) && ((_ext_id) < slave_id_to_sup_ext(MAX_NR_SLAVES)))
#define EVICTABLE_EXTENT(_ext_id)      ((_ext_id) >= EXT_SEQ_START || (_ext_id) == META_EXT_ID  \
                                            || EXT_ID_INVAL(_ext_id))

typedef uint32_t c_chk_cnt_t;
typedef uint32_t c_chk_t;
typedef uint64_t c_ext_id_t;
typedef uint32_t c_uuid_t;

#define INVAL_CHK                       ((c_chk_t)-1)
#define CHK_INVAL(_chk)                 ((_chk) == INVAL_CHK)

#define INVAL_EXT_ID                    (-1)
#define EXT_ID_INVAL(_id)               ((_id) == INVAL_EXT_ID)
#define RESERVE_EXT_ID                  (-2)        /**< See castle_cache_page_block_unreserve(). */
#define EXT_ID_RESERVE(_id)             ((_id) == RESERVE_EXT_ID)
#define INVAL_SLAVE_ID                  (0)

struct castle_chunk_sequence {
    /* align:   4 */
    /* offset:  0 */ c_chk_t         first_chk;
    /*          4 */ c_chk_cnt_t     count;
    /*          8 */
} PACKED;
typedef struct castle_chunk_sequence c_chk_seq_t;
#define INVAL_CHK_SEQ                ((c_chk_seq_t){0,0})
#define CHK_SEQ_INVAL(_seq)          ((_seq).count == 0)
#define CHK_SEQ_EQUAL(_seq1, _seq2)  (((_seq1).first_chk == (_seq2).first_chk) && \
                                      ((_seq1).count == (_seq2).count))
#define chk_seq_fmt                  "(0x%llx, 0x%llx)"
#define chk_seq2str(_seq)            (_seq).first_chk, (_seq).count

struct castle_disk_chunk {
    /* align:   4 */
    /* offset:  0 */ c_uuid_t        slave_id;
    /*          4 */ c_chk_t         offset;
    /*          8 */
} PACKED;
typedef struct castle_disk_chunk c_disk_chk_t;
#define INVAL_DISK_CHK               ((c_disk_chk_t){INVAL_SLAVE_ID,0})
#define DISK_CHK_INVAL(_chk)         (((_chk).slave_id == INVAL_SLAVE_ID) &&    \
                                      ((_chk).offset == 0))
#define DISK_CHK_EQUAL(_chk1, _chk2) (((_chk1).slave_id == (_chk2).slave_id) && \
                                      ((_chk1).offset == (_chk2).offset))
#define disk_chk_fmt                  "(0x%x, 0x%x)"
#define disk_chk_fmt_nl               "(0x%x, 0x%x)\n"
#define disk_chk2str(_chk)            (_chk).slave_id, (_chk).offset

typedef uint64_t c_byte_off_t;

/* Disk layout related structures (extent based) */
struct castle_extent_position {
    /* align:   8 */
    /* offset:  0 */ c_ext_id_t      ext_id;
    /*          8 */ c_byte_off_t    offset;
    /*         16 */
} PACKED;
typedef struct castle_extent_position c_ext_pos_t;
#define __INVAL_EXT_POS             {INVAL_EXT_ID,0}
#define INVAL_EXT_POS               ((c_ext_pos_t) __INVAL_EXT_POS)
#define EXT_POS_INVAL(_off)         ((_off).ext_id == INVAL_EXT_ID)
#define EXT_POS_EQUAL(_off1, _off2) (((_off1).ext_id == (_off2).ext_id) && \
                                      ((_off1).offset == (_off2).offset))
/**
 * Compare cep1 against cep2.
 *
 * @param cep1	cep to compare
 * @param cep2	cep to compare against
 *
 * @return -1	cep1 is prior to cep2
 * @return  0	cep1 is the same as cep2
 * @return  1	cep1 is after cep2
 */
static inline int EXT_POS_COMP(c_ext_pos_t cep1, c_ext_pos_t cep2)
{
    if(cep1.ext_id < cep2.ext_id)
        return -1;

    if(cep1.ext_id > cep2.ext_id)
        return 1;

    if(cep1.offset < cep2.offset)
        return -1;

    if(cep1.offset > cep2.offset)
        return 1;

	return 0;
}
#define cep_fmt_str                  "(%llu, 0x%llx (chunk %lld chunk_off 0x%llx))"
#define cep_fmt_str_nl               "(%llu, 0x%llx (chunk %lld chunk_off 0x%llx)).\n"
#define cep2str(_off)                (_off).ext_id, BLOCK((_off).offset), CHUNK((_off).offset), CHUNK_OFFSET((_off).offset)
#define __cep2str(_off)              (_off).ext_id, ((_off).offset), CHUNK((_off).offset), CHUNK_OFFSET((_off).offset)

typedef enum {
    DEFAULT_RDA,
    SSD_RDA,
    META_EXT,
    MICRO_EXT,
    SUPER_EXT,
    SSD_ONLY_EXT,
    NR_RDA_SPECS
} c_rda_type_t;

/* Type of data stored within extent. */
typedef enum {
    EXT_T_META_DATA,
    EXT_T_BTREE_NODES,
    EXT_T_INTERNAL_NODES,
    EXT_T_LEAF_NODES,
    EXT_T_MEDIUM_OBJECTS,
    EXT_T_LARGE_OBJECT,
    EXT_T_BLOOM_FILTER,
    EXT_T_INVALID,
} c_ext_type_t;

static USED char *castle_ext_type_str[] = { 
    "EXT_T_META_DATA",
    "EXT_T_BTREE_NODES",
    "EXT_T_INTERNAL_NODES",
    "EXT_T_LEAF_NODES",
    "EXT_T_MEDIUM_OBJECTS",
    "EXT_T_LARGE_OBJECT",
    "EXT_T_BLOOM_FILTER",
    "EXT_T_INVALID"
};

/* This type determines the way, this extent has to be handled in case of Low Free-Space (LFS) 
 * situation. */
typedef enum {
    LFS_VCT_T_T0_GRP,
    LFS_VCT_T_T0,
    LFS_VCT_T_MERGE,
    LFS_VCT_T_INVALID
} c_lfs_vct_type_t;

#define LFS_VCT_T_MAX_TYPE LFS_VCT_T_INVALID

static USED char *castle_lfs_vct_type_str[] = {
    "LFS_VCT_T_T0_GRP",
    "LFS_VCT_T_T0",
    "LFS_VCT_T_MERGE",
    "LFS_VCT_T_INVALID"
};

typedef int       (*c_ext_event_callback_t)                (void *data);

typedef struct castle_extent_freespace {
    c_ext_id_t      ext_id;
    c_byte_off_t    ext_size;
    atomic64_t      used;
    atomic64_t      blocked;
} c_ext_free_t;

typedef struct castle_extent_freespace_byte_stream {
    /* align:   8 */
    /* offset:  0 */ c_ext_id_t      ext_id;
    /*          8 */ c_byte_off_t    ext_size;
    /*         16 */ uint64_t        used;
    /*         24 */ uint64_t        blocked;
    /*         32 */ uint8_t         _unused[32];
    /*         64 */
} PACKED c_ext_free_bs_t;

typedef struct castle_freespace {
    /* align:   4 */
    /* offset:  0 */ uint32_t        max_entries;
    /*          4 */ uint32_t        nr_entries;
    /*          8 */ uint32_t        prod;
    /*         12 */ uint32_t        cons;
    /*         16 */ c_chk_cnt_t     free_chk_cnt;
    /*         20 */ c_chk_cnt_t     disk_size;
    /*         24 */ uint8_t         _unused[40];
    /*         64 */
} PACKED castle_freespace_t;

struct castle_elist_entry {
    /* align:   8 */
    /* offset:  0 */ c_ext_id_t      ext_id;
    /*          8 */ c_chk_cnt_t     size;
    /*         12 */ c_rda_type_t    type;
    /*         16 */ uint32_t        k_factor;
    /*         20 */ uint32_t        obj_refs;
    /*         24 */ c_ext_pos_t     maps_cep;
    /*         40 */ uint32_t        curr_rebuild_seqno;
    /*         44 */ uint32_t        da_id;
    /*         48 */ uint32_t        ext_type;
    /*         52 */ uint8_t         _unused[12];
    /*         64 */
} PACKED;

struct castle_extents_superblock {
    /* align:   8 */
    /* offset:  0 */ c_ext_id_t                 ext_id_seq;
    /*          8 */ uint64_t                   nr_exts;
    /*         16 */ struct castle_elist_entry  micro_ext;
    /*         80 */ struct castle_elist_entry  meta_ext;
    /*        144 */ struct castle_elist_entry  mstore_ext[2];
    /*        272 */ c_ext_free_bs_t            meta_ext_free_bs;
    /*        336 */ c_disk_chk_t               micro_maps[MAX_NR_SLAVES];
    /*        848 */ uint32_t                   current_rebuild_seqno;
    /*        852 */ uint8_t                    _unused[172];
    /*       1024 */
} PACKED;

struct castle_slave_superblock {
    /* align:   8 */
    /* offset:  0 */ struct castle_slave_superblock_public pub;
    /*        128 */ uint32_t                              fs_version;
    /*        132 */ castle_freespace_t                    freespace;
    /*        196 */ uint8_t                               _unused[60];
    /*        256 */
} PACKED;

struct castle_fs_superblock {
    /* align:   8 */
    /* offset:  0 */ struct castle_fs_superblock_public      pub;
    /*        128 */ uint32_t                                fs_version;
    /*        132 */ uint32_t                                nr_slaves;
    /*        136 */ uint32_t                                slaves[MAX_NR_SLAVES];
    /*        392 */ uint8_t                                 slaves_flags[MAX_NR_SLAVES];
    /*        456 */ struct castle_extents_superblock        extents_sb;
    /*       1480 */ c_ext_pos_t                             mstore[16];
    /*       1736 */ int                                     fs_in_rebuild;
    /*       1740 */ uint8_t                                 _unused[308];
    /*       2048 */
} PACKED;

enum {
    CVT_TYPE_LEAF_VAL        = 0x01,
    CVT_TYPE_LEAF_PTR        = 0x02,
    CVT_TYPE_NODE            = 0x04,
    /* TOMB_STONE points to NULL value (no value). */
    CVT_TYPE_TOMB_STONE      = 0x08,
    /* Value length is small enough to keep in B-tree node itself. */
    CVT_TYPE_INLINE          = 0x10,
    /* Set to 1 for both Large and Medium Objects */
    CVT_TYPE_ONDISK          = 0x20,
    /* Valid only when CVT_TYPE_ONDISK is set.
     * 1 - Large objects
     * 0 - Medium objects */
    CVT_TYPE_LARGE_OBJECT    = 0x40,
    CVT_TYPE_INVALID         = 0x00,
};

#define MAX_INLINE_VAL_SIZE            512      /* In bytes */
#define VLBA_TREE_MAX_KEY_SIZE         512      /* In bytes */
#define MEDIUM_OBJECT_LIMIT (20 * C_CHK_SIZE)
#define is_medium(_size)    (((_size) > MAX_INLINE_VAL_SIZE) && ((_size) <= MEDIUM_OBJECT_LIMIT))

struct castle_value_tuple {
    /* align:   8 */
    /* offset:  0 */ struct {
    /*          0 */     uint64_t      type:8;
    /*          1 */     uint64_t      length:56;
    /*          8 */ };
    /*          8 */ union {
    /*          8 */     c_ext_pos_t   cep;
    /*          8 */     uint8_t      *val;
    /*         24 */ };
    /*         24 */
} PACKED;
typedef struct castle_value_tuple c_val_tup_t;

#define INVAL_VAL_TUP        ((c_val_tup_t){{CVT_TYPE_INVALID, 0}, {.cep = INVAL_EXT_POS}})

#define CVT_LEAF_VAL(_cvt)      ((_cvt).type & CVT_TYPE_LEAF_VAL)
#define CVT_LEAF_PTR(_cvt)      ((_cvt).type & CVT_TYPE_LEAF_PTR)
#define CVT_NODE(_cvt)          ((_cvt).type & CVT_TYPE_NODE)
#define CVT_TOMB_STONE(_cvt)    (CVT_LEAF_VAL(_cvt) && ((_cvt).type & CVT_TYPE_TOMB_STONE))
#define CVT_INLINE(_cvt)        (CVT_LEAF_VAL(_cvt) && ((_cvt).type & CVT_TYPE_INLINE))
#define CVT_ONDISK(_cvt)        (CVT_LEAF_VAL(_cvt) && ((_cvt).type & CVT_TYPE_ONDISK))
#define CVT_MEDIUM_OBJECT(_cvt) (CVT_ONDISK(_cvt) && !((_cvt).type & CVT_TYPE_LARGE_OBJECT))
#define CVT_LARGE_OBJECT(_cvt)  (CVT_ONDISK(_cvt) && ((_cvt).type & CVT_TYPE_LARGE_OBJECT))
#define CVT_INVALID(_cvt)       ((_cvt).type == CVT_TYPE_INVALID)
#define CVT_ONE_BLK(_cvt)       (CVT_ONDISK(_cvt) &&  (_cvt).length == C_BLK_SIZE)
#define CVT_INVALID_SET(_cvt)                                               \
{                                                                           \
   (_cvt).type   = CVT_TYPE_INVALID;                                        \
   (_cvt).length = 0;                                                       \
   (_cvt).cep    = INVAL_EXT_POS;                                           \
}
#define CVT_LEAF_PTR_SET(_cvt, _length, _cep)                               \
{                                                                           \
   (_cvt).type   = CVT_TYPE_LEAF_PTR;                                       \
   (_cvt).length = _length;                                                 \
   (_cvt).cep    = _cep;                                                    \
}
#define CVT_NODE_SET(_cvt, _length, _cep)                                   \
{                                                                           \
   (_cvt).type   = CVT_TYPE_NODE;                                           \
   (_cvt).length = _length;                                                 \
   (_cvt).cep    = _cep;                                                    \
}
#define CVT_TOMB_STONE_SET(_cvt)                                            \
{                                                                           \
   (_cvt).type   = (CVT_TYPE_LEAF_VAL | CVT_TYPE_TOMB_STONE);               \
   (_cvt).length = 0;                                                       \
   (_cvt).cep    = INVAL_EXT_POS;                                           \
}
#define CVT_INLINE_SET(_cvt, _length, _ptr)                                 \
{                                                                           \
   (_cvt).type   = (CVT_TYPE_LEAF_VAL | CVT_TYPE_INLINE);                   \
   (_cvt).length = _length;                                                 \
   (_cvt).val    = _ptr;                                                    \
}
#define CVT_MEDIUM_OBJECT_SET(_cvt, _length, _cep)                          \
{                                                                           \
    (_cvt).type  = (CVT_TYPE_LEAF_VAL | CVT_TYPE_ONDISK);                   \
    (_cvt).length= _length;                                                 \
    (_cvt).cep   = _cep;                                                    \
}
#define CVT_LARGE_OBJECT_SET(_cvt, _length, _cep)                           \
{                                                                           \
    (_cvt).type  = (CVT_TYPE_LEAF_VAL | CVT_TYPE_ONDISK | CVT_TYPE_LARGE_OBJECT); \
    (_cvt).length= _length;                                                 \
    (_cvt).cep   = _cep;                                                    \
}
#define CVT_INLINE_VAL_LENGTH(_cvt)                                             \
                             (CVT_INLINE(_cvt)?((_cvt).length):0)

#define CVT_EQUAL(_cvt1, _cvt2)                                                 \
                             ((_cvt1).type      == (_cvt2).type &&              \
                              (_cvt1).length    == (_cvt2).length &&            \
                              (!CVT_ONDISK(_cvt1) ||                            \
                               EXT_POS_EQUAL((_cvt1).cep, (_cvt2).cep)))
#if 0
#define CEP_TO_CVT(_cvt, _cep, _blks, _type)                                    \
                                {                                               \
                                    (_cvt).type     = _type;                    \
                                    (_cvt).length   = (_blks) * C_BLK_SIZE;     \
                                    (_cvt).cep      = _cep;                     \
                                }
#endif


typedef uint8_t c_mstore_id_t;

typedef struct castle_mstore_key {
    c_ext_pos_t  cep;
    int          idx;
} c_mstore_key_t;

#define INVAL_MSTORE_KEY           ((c_mstore_key_t){.cep = __INVAL_EXT_POS, .idx = 0})
#define MSTORE_KEY_INVAL(_k)       (EXT_POS_INVAL(_k.cep) && ((_k).idx == 0))
#define MSTORE_KEY_EQUAL(_k1, _k2) (EXT_POS_EQUAL(_k1.cep, _k2.cep)  &&         \
                                    ((_k1).idx == (_k2).idx))
typedef struct castle_mstore {
    c_mstore_id_t              store_id;             /* Id of the store, ptr in fs_sb    */
    size_t                     entry_size;           /* Size of the entries stored       */
    struct semaphore           mutex;                /* Mutex which protects the         */
                                                     /*  last_node_* variables           */
    c_ext_pos_t                last_node_cep;        /* Tail of the list, has at least   */
                                                     /* one unused entry in it           */
    int                        last_node_unused;     /* Number of unused entries in the  */
                                                     /* last node                        */
} c_mstore_t;

typedef struct castle_mstore_iter {
    struct castle_mstore      *store;                /* Store we are iterating over      */
    struct castle_cache_block *node_c2b;             /* Currently accessed node (locked) */
    int                        node_idx;             /* Next entry index in current node */
} c_mstore_iter_t;

enum {
    MSTORE_VERSIONS_ID,
    MSTORE_BLOCK_CNTS,
    MSTORE_DOUBLE_ARRAYS,
    MSTORE_COMPONENT_TREES,
    MSTORE_ATTACHMENTS_TAG,
    MSTORE_EXTENTS,
    MSTORE_LARGE_OBJECTS,
    MSTORE_DA_MERGE,
    MSTORE_STATS,
};


#define MTREE_TYPE                 0x33
#define MTREE_BVEC_BLOCK(_bvec)   ((sector_t)(_bvec)->key)
#define BATREE_TYPE                0x44
#define RW_VLBA_TREE_TYPE          0x55
#define RO_VLBA_TREE_TYPE          0x66

#define MAX_BTREE_DEPTH           (10)               /**< Maximum depth of btrees.
                                                          This is used in on-disk datastructures.
                                                          For example castle_clist_entry.
                                                          If modified, those need to be reviewed.
                                                      */
#define VLBA_HDD_RO_TREE_NODE_SIZE      (64)  /**< Size of the default RO tree node size. */
#define VLBA_SSD_RO_TREE_NODE_SIZE      (2)   /**< Size of the RO tree node size on SSDs. */

typedef uint8_t btree_t;

#define BTREE_NODE_MAGIC  0x0100cdab
struct castle_btree_node {
    /* align:   8 */
    /* offset:  0 */ uint32_t        magic;
    /*          4 */ uint32_t        version;
    /*          8 */ uint32_t        used;
    /*         12 */ btree_t         type;
    /*         13 */ uint8_t         is_leaf;
    /*         14 */ uint16_t        size;           /**< Size of this btree node in pages.     */
                     /* Payload (i.e. btree entries) depend on the B-tree type */
    /*         16 */ uint8_t         _unused[48];
    /*         64 */ uint8_t         payload[0];
    /*         64 */
} PACKED;

#define BTREE_NODE_PAYLOAD(_node)   ((void *)&(_node)->payload)

#define PLUS_INFINITY_DIM_LENGTH 0xFFFFFFFF

typedef struct castle_var_length_btree_key {
    /* align:   4 */
    /* offset:  0 */ uint32_t length;
    /*          4 */ uint32_t nr_dims;
    /*          8 */ uint8_t  _unused[8];
    /*         16 */ uint32_t dim_head[0];
    /*         16 */
    /* Dimension header is followed by individual dimensions. */
} PACKED c_vl_bkey_t;

/* Below encapsulates the internal btree node structure, different type of
   nodes may be used for different trees */
struct castle_component_tree;
struct castle_btree_type {
    btree_t    magic;         /* Also used as an index to castle_btrees
                                 array.                                 */
    void      *min_key;       /* Minimum key                            */
    void      *max_key;       /* Maximum used as the end of node marker */
    void      *inv_key;       /* An invalid key, comparison with it
                                 should always return a negative number
                                 except if also compared to invalid key
                                 in which case cmp should return zero   */
    uint16_t (*node_size)     (struct castle_component_tree *ct,
                               uint8_t level);
                              /**< Gives btree node size at the given
                                   level. Levels are counted in reverse
                                   order. I.e. leaf level is 0, etc.
                                   This makes it possible to grow the tree
                                   without renumbering all the existing
                                   levels. */
    int      (*need_split)    (struct castle_btree_node *node,
                               int                       version_or_key);
                              /* 0 - version split, 1 - key split       */
    int      (*key_compare)   (void *key1, void *key2);
                              /* Returns negative if key1 < key2, zero
                                 if equal, positive otherwise           */
    void*    (*key_duplicate) (void *key);
                              /* Returns duplicate of key. Need to call
                               * a dealloc later to free resources      */
    void*    (*key_next)      (void *key);
                              /* Successor key, succ(MAX) = INVAL,
                                 succ(INVAL) = INVAL                    */
    void     (*key_dealloc)   (void *key);
                              /* Destroys the key, frees resources
                                 associated with it                     */
    uint32_t (*key_hash)      (void *key, uint32_t seed);
                              /* Get hash of key with seed              */
    int      (*entry_get)     (struct castle_btree_node *node,
                               int                       idx,
                               void                    **key_p,
                               version_t                *version_p,
                               c_val_tup_t              *cvt_p);
    void     (*entry_add)     (struct castle_btree_node *node,
                               int                       idx,
                               void                     *key,
                               version_t                 version,
                               c_val_tup_t               cvt);
    void     (*entry_replace) (struct castle_btree_node *node,
                               int                       idx,
                               void                     *key,
                               version_t                 version,
                               c_val_tup_t               cvt);
    void     (*entry_disable) (struct castle_btree_node *node,
                               int                       idx);
    void     (*entries_drop)  (struct castle_btree_node *node,
                               int                       idx_start,
                               int                       idx_end);
                              /* Drop all entries between idx_start and
                                 idx_stop. Inclusive                    */
    void     (*node_print)    (struct castle_btree_node *node);
#ifdef CASTLE_DEBUG
    void     (*node_validate) (struct castle_btree_node *node);
#endif
};

#define MTREE_NODE_SIZE     (10) /* In blocks */

typedef struct castle_bloom_filter {
    uint8_t                   num_hashes;
    uint32_t                  block_size_pages;
    uint32_t                  num_chunks;
    uint32_t                  num_blocks_last_chunk;
    uint64_t                  chunks_offset;
    uint32_t                  num_btree_nodes;
    struct castle_btree_type *btree;
    c_ext_id_t                ext_id;
    void                     *private; /* used for builds */
#ifdef CASTLE_BLOOM_FP_STATS
    atomic64_t                queries;
    atomic64_t                false_positives;
#endif
} castle_bloom_t;

struct castle_bbp_entry
{
    /* align:   8 */
    /* offset:  0 */ uint64_t    expected_num_elements;
    /*          8 */ uint64_t    elements_inserted;
    /*         16 */ uint32_t    chunks_complete;
    /*         20 */ uint32_t    cur_node_cur_chunk_id;
    /*         24 */ uint32_t    cur_chunk_num_blocks;
    /*         28 */ uint32_t    nodes_complete;
    /*         32 */ c_ext_pos_t node_cep;
    /*         48 */ c_ext_pos_t chunk_cep;
    /*         64 */ uint32_t    node_used;   /* for entries_drop */
    /*         68 */ uint8_t     node_avail;  /* flag to indicate if we should recover node */
    /*         69 */ uint8_t     chunk_avail; /* flag to indicate if we should recover chunk */
    /*         70 */
} PACKED;

struct castle_component_tree {
    tree_seq_t          seq;               /**< Unique ID identifying this tree.                */
    atomic_t            ref_count;
    atomic_t            write_ref_count;
    atomic64_t          item_count;        /**< Number of items in the tree.                    */
    btree_t             btree_type;
    uint8_t             dynamic;           /**< 1 - dynamic modlist btree, 0 - merge result.    */
    da_id_t             da;
    uint8_t             level;             /**< Level in the doubling array.                    */
    uint16_t            node_sizes[MAX_BTREE_DEPTH];
                                           /**< Size of nodes in each level in the b-tree,
                                                in pages. Only used for !dynamic (i.e. RO)
                                                trees. Stored in reverse order,
                                                i.e. node_sizes[0] is the size of leaf level,
                                                node_sizes[tree_depth-1] is the size of the
                                                root node. */
    uint8_t             new_ct;            /**< Marked for cts which are not yet flushed onto
                                                the disk.                                       */
    uint8_t             compacting;        /**< compaction is going on this CT.                 */
    struct rw_semaphore lock;              /**< Protects root_node, tree depth & last_node.     */
    uint8_t             tree_depth;
    c_ext_pos_t         root_node;
    struct list_head    da_list;
    struct list_head    hash_list;
    struct list_head    large_objs;
    struct mutex        lo_mutex;          /**< Protects Large Object List. When working with
                                                the output CT of a serialisable merge, never
                                                take this lock before serdes.mutex or there will
                                                be deadlock against checkpoint thread. */
    c_ext_free_t        internal_ext_free;
    c_ext_free_t        tree_ext_free;
    c_ext_free_t        data_ext_free;
    atomic64_t          large_ext_chk_cnt;
    uint8_t             bloom_exists;
    castle_bloom_t      bloom;
#ifdef CASTLE_PERF_DEBUG
    u64                 bt_c2bsync_ns;
    u64                 data_c2bsync_ns;
    u64                 get_c2b_ns;
#endif
};
extern struct castle_component_tree castle_global_tree;

struct castle_large_obj_entry {
    c_ext_id_t          ext_id;
    uint64_t            length;
    struct list_head    list;
};

struct castle_dlist_entry {
    /* align:   4 */
    /* offset:  0 */ da_id_t     id;
    /*          4 */ version_t   root_version;
    /*          8 */ uint8_t     _unused[248];
    /*        256 */
} PACKED;

struct castle_clist_entry {
    /* align:   8 */
    /* offset:  0 */ da_id_t         da_id;
    /*          4 */ btree_t         btree_type;
    /*          5 */ uint8_t         dynamic;
    /*          6 */ uint8_t         level;
    /*          7 */ uint8_t         tree_depth;
    /*          8 */ uint64_t        item_count;
    /*         16 */ c_ext_pos_t     root_node;
    /*         32 */ c_ext_free_bs_t internal_ext_free_bs;
    /*         96 */ c_ext_free_bs_t tree_ext_free_bs;
    /*        160 */ c_ext_free_bs_t data_ext_free_bs;
    /*        224 */ uint64_t        large_ext_chk_cnt;
    /*        232 */ uint32_t        bloom_num_chunks;
    /*        236 */ uint32_t        bloom_num_blocks_last_chunk;
    /*        240 */ uint64_t        bloom_chunks_offset;
    /*        248 */ c_ext_id_t      bloom_ext_id;
    /*        256 */ uint32_t        bloom_num_btree_nodes;
    /*        260 */ uint32_t        bloom_block_size_pages;
    /*        264 */ tree_seq_t      seq;
    /*        268 */ uint8_t         bloom_exists;
    /*        269 */ uint8_t         bloom_num_hashes;
    /*        270 */ uint16_t        node_sizes[MAX_BTREE_DEPTH];
    /*        290 */ uint8_t         _unused[222];
    /*        512 */
} PACKED;

/** DA merge SERDES on-disk structure.
 *
 *  @note Assumes 2 input trees, both c_immut_iter_t, and max of 10 DA levels
 */
struct castle_dmserlist_entry {
    /* align:   8 */
    /* offset:  0 */ da_id_t                     da_id;
    /*          4 */ int32_t                     level;
    /* On in_trees... each in_tree can identify which DA and level it belongs to, so it is up to
       the trees to find their DA, not the DA to find it's trees. On any given level there can
       be more than 2 trees (but no more than 4? don't quote me on that); the choice of which 2
       trees to merge is dictated by their age (oldest trees first), which is implicit in their
       location in the level ("left-most" first?). But just in case something goes wrong, lets
       check the tree sequence numbers as well. */
    /*          8 */ tree_seq_t                  in_tree_0;
    /*         12 */ tree_seq_t                  in_tree_1;
    /*         16 */ struct castle_clist_entry   out_tree;
    /*        528 */ btree_t                     btree_type;
    /*        529 */ int32_t                     root_depth;
    /*        533 */ int8_t                      is_new_key;
    /*        534 */ c_ext_pos_t                 last_leaf_node_cep;
    /*        550 */ int8_t                      completing;
    /*        551 */ uint64_t                    nr_entries;
    /*        559 */ uint64_t                    large_chunks;
    /*        567 */ int8_t                      leafs_on_ssds;
    /*        568 */ int8_t                      internals_on_ssds;
    /*        569 */ uint32_t                    skipped_count;
    /*        573 */

                   /* next few entries assume MAX_BTREE_DEPTH=10 */
                   /* TODO@tr change SoA to Aos */
    /*        573 */ c_ext_pos_t                 node_c2b_cep[MAX_BTREE_DEPTH];
    /*        733 */ int32_t                     next_idx[MAX_BTREE_DEPTH];
    /*        773 */ int32_t                     node_used[MAX_BTREE_DEPTH]; /* uncertain if this
                                                                                is needed... might
                                                                                get rid of it */
    /*        813 */ int32_t                     valid_end_idx[MAX_BTREE_DEPTH];
    /*        853 */ version_t                   valid_version[MAX_BTREE_DEPTH];
    /*        893 */ uint8_t                     pad_to_iters[3]; /* beyond here entries are
                                                                     frequently marshalled, so
                                                                     alignment is important */

                    /* iterators, assuming we always have 2 immut_iters per merge */
    /*        896 */ int32_t                     iter_err;
    /*        900 */ int64_t                     iter_non_empty_cnt;
    /*        908 */ uint64_t                    iter_src_items_completed;
    /*        916 */
                          /* 2 immutable iterators */
                          /* TODO@tr change SoA to AoS */
    /*        916 */ int32_t                     iter_component_completed[2];
    /*        924 */ int32_t                     iter_component_cached[2];
    /*        932 */ int32_t                     iter_immut_curr_idx[2];
    /*        940 */ int32_t                     iter_immut_cached_idx[2];
    /*        948 */ int32_t                     iter_immut_next_idx[2];
    /*        956 */ c_ext_pos_t                 iter_immut_curr_c2b_cep[2];
    /*        988 */ c_ext_pos_t                 iter_immut_next_c2b_cep[2];

    /*       1020 */ uint8_t                     pad_to_bloom_build_params[4];
    /*       1024 */

    /*       1024 */ struct castle_bbp_entry     out_tree_bbp;
    /*       1094 */ uint8_t                     have_bbp;
    /*       1095 */ uint8_t                     pad[441];
    /*       1536 */

} PACKED;
#define SIZEOF_CASTLE_DMSERLIST_ENTRY (1536)

/**
 * Ondisk Serialized structure for castle versions.
 */
struct castle_vlist_entry {
    /* align:   8 */
    /* offset:  0 */ version_t    version_nr;
    /*          4 */ version_t    parent;
    /*          8 */ da_id_t      da_id;
    /*         12 */ uint8_t      _pad[4];
    /*         16 */ uint64_t     size;
    /*         24 */ uint64_t     flags;                /**< Flags for version LEAF & DELETED.  */
    /*         32 */ uint64_t     keys;                 /**< stats.keys                         */
    /*         40 */ uint64_t     tombstones;           /**< stats.tombstones                   */
    /*         48 */ uint64_t     tombstone_deletes;    /**< stats.tombstone_deletes            */
    /*         56 */ uint64_t     version_deletes;      /**< stats.version_deletes              */
    /*         64 */ uint64_t     key_replaces;         /**< stats.key_replaces                 */
    /*         72 */ uint8_t      _unused[184];
    /*        256 */
} PACKED;

#define MAX_NAME_SIZE 128
struct castle_alist_entry {
    /* align:   4 */
    /* offset:  0 */ version_t   version;
    /*          4 */ char        name[MAX_NAME_SIZE];
    /*        132 */ uint8_t     _unused[124];
    /*        256 */
} PACKED;

#define MLIST_NODE_MAGIC  0x0000baca
struct castle_mlist_node {
    /* align:   8 */
    /* offset:  0 */ uint32_t    magic;
    /*          4 */ uint16_t    capacity;
    /*          6 */ uint16_t    used;
    /*          8 */ c_ext_pos_t next;
    /*         24 */ uint8_t     _unused[40];
    /*         64 */ uint8_t     payload[0];
    /*         64 */
} PACKED;

struct castle_lolist_entry {
    /* align:   8 */
    /* offset:  0 */ c_ext_id_t  ext_id;
    /*          8 */ uint64_t    length;
    /*         16 */ tree_seq_t  ct_seq;
    /*         20 */ uint8_t     _unused[12];
    /*         32 */
} PACKED;

enum {
    STATS_MSTORE_REBUILD_PROGRESS,
};

struct castle_slist_entry {
    /* align:  8 */
    /* offset: 0 */ uint16_t    stat_type;
    /*         2 */ uint8_t     _pad[6];
    /*         8 */ uint64_t    key;
    /*        16 */ uint64_t    val;
    /*        24 */ uint8_t     _unused[40];
    /*        64 */
} PACKED;

/* IO related structures */
struct castle_bio_vec;
struct castle_object_replace;
struct castle_object_get;

typedef struct castle_bio {
    struct castle_attachment         *attachment;
    /* castle_bio is created to handle a bio, or an rxrpc call (never both) */
    int                               data_dir;
    /* Pointer to the op that created this c_bio. */
    union {
        struct bio                   *bio;
        struct castle_object_replace *replace;
        struct castle_object_get     *get;
        struct castle_object_pull    *pull;
    };
    struct castle_bio_vec            *c_bvecs;
    atomic_t                          count;
    int                               err;
#ifdef CASTLE_DEBUG
    int                               stuck;
    int                               id;
    int                               nr_bvecs;
    struct list_head                  list;
#endif
} c_bio_t;


